{
  "ir_version": "1.0",
  "project": "agentplexus.github.io",
  "repository": "https://github.com/agentplexus/agentplexus.github.io",
  "versioning": "semver",
  "commit_convention": "conventional",
  "maintainers": ["agentplexus"],
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-02-02",
      "highlights": [
        { "description": "Add Releases page with ReleaseLogViewer and Resources dropdown navigation" }
      ],
      "added": [
        { "description": "Releases page using `@grokify/releaselog` viewer from unpkg CDN", "commit": "c8872e1" },
        { "description": "Resources dropdown menu consolidating Blog, Releases, Philosophy, and RSS", "commit": "c8872e1" },
        { "description": "TODO.md with infrastructure improvement roadmap", "commit": "5740197" }
      ],
      "changed": [
        { "description": "Navigation reduced from 8 top-level items to 5 with Resources dropdown", "commit": "c8872e1" },
        { "description": "Mobile menu updated with Resources section header", "commit": "c8872e1" }
      ],
      "removed": [
        { "description": "Duplicate SVG tools (migrated to github.com/grokify/brandkit)", "commit": "d10f852" }
      ],
      "fixed": [
        { "description": "GitHub Actions artifact path corrected from `dist` to `docs`", "commit": "ca880de" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-04",
      "highlights": [
        { "description": "Initial release of AgentPlexus website with projects, integrations, blog, and MCP pages" }
      ],
      "added": [
        { "description": "React-based website with Tailwind CSS and dark theme", "commit": "9d7d066" },
        { "description": "Homepage with hero, products, philosophy, and getting started sections", "commit": "9d7d066" },
        { "description": "Projects page showcasing AgentPlexus repositories", "commit": "9d7d066" },
        { "description": "Integrations page with categorized integration cards", "commit": "9d7d066" },
        { "description": "Blog with Markdown support and Atom feed", "commit": "9d7d066" },
        { "description": "MCP (Model Context Protocol) servers page", "commit": "9d7d066" },
        { "description": "GitHub Pages deployment with SPA routing via 404.html", "commit": "9d7d066" },
        { "description": "AWS CDK and Pulumi integrations", "commit": "f0872fb" },
        { "description": "SVG conversion and verification tools", "commit": "f0872fb" },
        { "description": "go-opik repository branding update", "commit": "a34258c" }
      ]
    }
  ]
}
